src/Documents/ПрибытиеНаБерегА/ПрибытиеНаБерегА.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПрибытиеНаБерегА</name>
  <registerRecords>AccumulationRegister.ОбъектыНаБерегах</registerRecords>
  <attributes>
    <name>Берег</name>
    <type>
      <types>CatalogRef.Берега</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокПассажиров</name>
    <attributes>
      <name>Пассажир</name>
      <type>
        <types>CatalogRef.Пассажиры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/ОбъектыНаБерегах/ОбъектыНаБерегах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОбъектыНаБерегах</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Пассажир</name>
    <type>
      <types>CatalogRef.Пассажиры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Берег</name>
    <type>
      <types>CatalogRef.Берега</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/ПрибытиеНаБерегА/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр ОбъектыНаБерегах Приход
	Движения.ОбъектыНаБерегах.Записывать = Истина;
	
	Для Каждого ТекСтрокаСписокПассажиров Из СписокПассажиров Цикл
		Движение = Движения.ОбъектыНаБерегах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Пассажир = ТекСтрокаСписокПассажиров.Пассажир;
		Движение.Берег = Берег;
		Движение.Количество = 1;
	КонецЦикла;
	
КонецПроцедуры
